lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
holyiot_25007_nrf54l15.menu.clean_matter.off=Disabled (Default)
holyiot_25007_nrf54l15.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
holyiot_25007_nrf54l15.menu.clean_matter.off.build.matter_seam_flags=

holyiot_25007_nrf54l15.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
holyiot_25007_nrf54l15.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
holyiot_25007_nrf54l15.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/config/arduino -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/support -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/system -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/inet -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/crypto -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/protocols -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/transport -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/messaging -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/platform/arduino

holyiot_25007_nrf54l15.menu.clean_upload.auto=nRF OCD Native (Default)
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.tool=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.tool.serial=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.runner=nrf_ocd
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.wait_for_upload_port=false

holyiot_25007_nrf54l15.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.tool=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.runner=pyocd
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd=nRF OCD (Native Fallback)
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool.serial=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.runner=nrf_ocd
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.wait_for_upload_port=false

holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.runner=pyocd
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

holyiot_25007_nrf54l15.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.tool=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.protocol=uf2
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.runner=uf2
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.wait_for_upload_port=false

holyiot_25008_nrf54l15.name=HOLYIOT-25008 nRF54L15 Module

holyiot_25008_nrf54l15.upload.tool=nrf54ocd
holyiot_25008_nrf54l15.upload.tool.serial=nrf54ocd
holyiot_25008_nrf54l15.upload.protocol=cmsis-dap
holyiot_25008_nrf54l15.upload.maximum_size=1548288
holyiot_25008_nrf54l15.upload.maximum_data_size=155648
holyiot_25008_nrf54l15.upload.wait_for_upload_port=false
holyiot_25008_nrf54l15.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.upload.disable_flushing=true
holyiot_25008_nrf54l15.upload.runner=nrf_ocd
holyiot_25008_nrf54l15.upload.target=nrf54l
holyiot_25008_nrf54l15.upload.uid=
holyiot_25008_nrf54l15.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
holyiot_25008_nrf54l15.upload.openocd_speed=4000
holyiot_25008_nrf54l15.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

holyiot_25008_nrf54l15.serial.disableDTR=false
holyiot_25008_nrf54l15.serial.disableRTS=false

holyiot_25008_nrf54l15.build.mcu=cortex-m33
holyiot_25008_nrf54l15.build.f_cpu=64000000L
holyiot_25008_nrf54l15.build.board=HOLYIOT_25008_NRF54L15
holyiot_25008_nrf54l15.build.core=nrf54l15
holyiot_25008_nrf54l15.build.variant=holyiot_25008_nrf54l15
holyiot_25008_nrf54l15.build.ldscript=nrf54l15_linker_script.ld
holyiot_25008_nrf54l15.build.uf2_family=0xADA54B15
holyiot_25008_nrf54l15.build.uf2_base_address=0x00000000
holyiot_25008_nrf54l15.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
holyiot_25008_nrf54l15.build.power_flags=-DNRF54L15_CLEAN_POWER_LOW
holyiot_25008_nrf54l15.build.boot_flags=
holyiot_25008_nrf54l15.build.auto_gate_flags=
holyiot_25008_nrf54l15.build.security_flags=
holyiot_25008_nrf54l15.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1
holyiot_25008_nrf54l15.build.ble_tx_flags=
holyiot_25008_nrf54l15.build.ble_timing_flags=
holyiot_25008_nrf54l15.build.ble_trace_flags=
holyiot_25008_nrf54l15.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
holyiot_25008_nrf54l15.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED
holyiot_25008_nrf54l15.build.zigbee_channel_flags=
holyiot_25008_nrf54l15.build.zigbee_pan_flags=
holyiot_25008_nrf54l15.build.antenna_flags=
holyiot_25008_nrf54l15.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER

holyiot_25008_nrf54l15.menu.cpu_freq.64m=64 MHz (Default)
holyiot_25008_nrf54l15.menu.cpu_freq.64m.build.f_cpu=64000000L
holyiot_25008_nrf54l15.menu.cpu_freq.64m.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
holyiot_25008_nrf54l15.menu.cpu_freq.128m=128 MHz
holyiot_25008_nrf54l15.menu.cpu_freq.128m.build.f_cpu=128000000L
holyiot_25008_nrf54l15.menu.cpu_freq.128m.build.cpu_flags=-DARDUINO_NRF54_CPU_128M

holyiot_25008_nrf54l15.build.extra_flags=-DARDUINO_NRF54L15 -DNRF54L15_XXAA {build.cpu_flags} {build.power_flags} {build.boot_flags} {build.auto_gate_flags} {build.security_flags} {build.ble_flags} {build.ble_tx_flags} {build.ble_timing_flags} {build.ble_trace_flags} {build.vpr_flags} {build.zigbee_flags} {build.zigbee_channel_flags} {build.zigbee_pan_flags} {build.thread_flags} {build.thread_seam_flags} {build.thread_crypto_flags} {build.matter_flags} {build.matter_seam_flags} {build.antenna_flags} {build.serial_flags}

